//=======================================================================================
//!	@file	:	ResourcePool.cpp
//!	@brief	:	ResourcePoolクラスのメンバ関数宣言
//!	@author	:	小山 瑛圭
//!	@date	:	2014/5/01
//!	@par	:	example
//!	@note	:	example
//=======================================================================================

#include "ResourcePool.h"
#include "StringEncoder.h"

using namespace AK;
using namespace Graphics;
using namespace std;
//=======================================================================================
//		Constants Definitions
//=======================================================================================

//-------------------------------------------------------------
//!	@brief		: コンストラクタ
//-------------------------------------------------------------
ResourcePool::ResourcePool()
{

}
//-------------------------------------------------------------
//!	@brief		: デストラクタ
//-------------------------------------------------------------
ResourcePool::~ResourcePool()
{
	auto iResouce = m_ManagedResource.begin();
	while (iResouce != m_ManagedResource.end())
	{
		iResouce = m_ManagedResource.erase(iResouce);
	}
}
//=======================================================================================
//		public method
//=======================================================================================

//-------------------------------------------------------------
//!	@brief		: リソースの取得
//!	@param[in]	: リソースの名前(ファイルから読み込むときはファイルパスかな？)
//!	@param[in]	: リソースタイプの指定。
//!	@return		: example
//-------------------------------------------------------------
void ResourcePool::SplitDataPath(string src, string& dataType, string& resourceType, string& name)
{
	static StringEncoder encoder;

	encoder.DeleteSpace(src);
	dataType		= encoder.SplitFront(src, ":");
	resourceType	= encoder.SplitFront(src, "-");
	name			= src;

	assert(dataType		!= "");
	assert(resourceType	!= "");
	assert(name			!= "");
}
//-------------------------------------------------------------
//!	@brief		: example
//!	@param[in]	: example
//!	@return		: example
//-------------------------------------------------------------

//=======================================================================================
//		protected method
//=======================================================================================

//=======================================================================================
//		private method
//=======================================================================================

//===============================================================
//	End of File
//===============================================================


//!<