//=======================================================================================
//!	@file	:	Singleton.h
//!	@author	:	小山 瑛圭
//!	@date	:	2014/4/28
//=======================================================================================
#pragma once

namespace AK
{
//=======================================================================================
//!	@class	:	Singleton
//!	@brief	:	example
//!	@par	:	example
//!	@note	:	example
//=======================================================================================
template <class T>
class Singleton
{
public:

	static T*		CreateSingleton();
	static void		DestroySingleton();

	static T*		GetInstance();

protected:

	Singleton(){};
	virtual ~Singleton(){};

private:
	Singleton(const Singleton&){}
	const Singleton& operator = (const Singleton&){};

	static T* m_Instance;

};
//=======================================================================================
//		Constants Definitions
//=======================================================================================
template <class T>
T* Singleton<T>::m_Instance	= NULL;
//=======================================================================================
//		inline method
//=======================================================================================
//-------------------------------------------------------------
//!	@brief		: コンストラクタ
//-------------------------------------------------------------
template <class T>
T* Singleton<T>::CreateSingleton()
{
	if (!m_Instance)
		m_Instance = NEW T();
	return m_Instance;
}
//-------------------------------------------------------------
//!	@brief		: コンストラクタ
//-------------------------------------------------------------
template <class T>
void Singleton<T>::DestroySingleton()
{
	SAFE_DELETE(m_Instance);
}
//-------------------------------------------------------------
//!	@brief		: インスタンスの取得(実際にはCreateSingletonがインスタンスを生成済みか判断してくれる)
//-------------------------------------------------------------
template <class T>
T* Singleton<T>::GetInstance()
{
	return CreateSingleton();
}

};
//===============================================================
//	End of File
//===============================================================