//=======================================================================================
//!	@file	:	Title.h
//!	@author	:	小山 瑛圭
//!	@date	:	2014/4/28
//=======================================================================================
#pragma once
#include "SceneNode.h"
namespace AK
{
//=======================================================================================
//!	@class	:	Title
//!	@brief	:	タイトルシーンクラス
//!	@par	:	example
//!	@note	:	example
//=======================================================================================
class Title: public SceneNode
{
public:
	Title(INode* parent);
	virtual ~Title();

	void Update();
	SceneNode*	ChangeScene();
	bool		Initialize();

private:
	bool		m_IsEnd;
	F32			m_FadeVolume;
};


};
//===============================================================
//	End of File
//===============================================================