//=======================================================================================
//!	@file	:	Sample.cpp
//!	@brief	:	Sampleクラスのメンバ関数宣言
//!	@author	:	小山 瑛圭
//!	@date	:	2014/5/01
//!	@par	:	example
//!	@note	:	example
//=======================================================================================
#include "TriangleRenderer.h"
#include "GraphicsManager.h"
#include "Material.h"

using namespace AK;
using namespace Graphics;
//=======================================================================================
//		Constants Definitions
//=======================================================================================

//-------------------------------------------------------------
//!	@brief		: コンストラクタ
//-------------------------------------------------------------
TriangleRenderer::TriangleRenderer()
{
}
//-------------------------------------------------------------
//!	@brief		: デストラクタ
//-------------------------------------------------------------
TriangleRenderer::~TriangleRenderer()
{
}
//=======================================================================================
//		public method
//=======================================================================================
//-------------------------------------------------------------
//!	@brief		: 三角形描画
//-------------------------------------------------------------
void TriangleRenderer::Draw()
{
	if (!m_IsActive)
		return;

	BufferResource* resource = (BufferResource*)m_BufferResource.GetSharedObject();

	IDirect3DIndexBuffer9* indexBuffer = resource->GetIndexBuffer();

	GraphicsManager::GetInstance()->GetD3DDevice()->SetIndices(indexBuffer);

	IndexData drawData = resource->GetIndexData();

	GraphicsManager::GetInstance()->GetD3DDevice()->DrawIndexedPrimitive(
		D3DPT_TRIANGLELIST, 
		0,
		drawData.start,
		drawData.vertexNum,
		0, 
		drawData.face);
}

//=======================================================================================
//		protected method
//=======================================================================================

//=======================================================================================
//		private method
//=======================================================================================

//===============================================================
//	End of File
//===============================================================